import i11 from "./images/i11.webp";
import i12 from "./images/i12.webp";
import i13 from "./images/i13.webp";
import i21 from "./images/i21.webp";
import i22 from "./images/i22.webp";
import i23 from "./images/i23.webp";
import i31 from "./images/i31.webp";
import i32 from "./images/i32.webp";
import i33 from "./images/i33.webp";
import i41 from "./images/i41.webp";
import i42 from "./images/i42.webp";
import i43 from "./images/i43.webp";

import r1 from "./images/r1.webp";
import r2 from "./images/r2.webp";
import r3 from "./images/r3.webp";
import r4 from "./images/r4.webp";
import r5 from "./images/r5.webp";
import r6 from "./images/r6.webp";
import r7 from "./images/r7.webp";
import r8 from "./images/r8.webp";
import r9 from "./images/r9.webp";
import r10 from "./images/r10.webp";
import r11 from "./images/r11.webp";
import r12 from "./images/r12.webp";
import r13 from "./images/r13.webp";
import r14 from "./images/r14.webp";

import rv1 from "./images/rv1.webp";
import rv2 from "./images/rv2.webp";
import rv3 from "./images/rv3.webp";
import rv4 from "./images/rv4.webp";
import rv5 from "./images/rv5.webp";
import rv6 from "./images/rv6.webp";
import rv7 from "./images/rv7.webp";
import rv8 from "./images/rv8.webp";
import rv9 from "./images/rv9.webp";
import rv10 from "./images/rv10.webp";
import rv11 from "./images/rv11.webp";
import rv12 from "./images/rv12.webp";
import rv13 from "./images/rv13.webp";
import rv14 from "./images/rv14.webp";

import bu1 from "./images/bu1.webp";
import bu2 from "./images/bu2.webp";
import bu3 from "./images/bu3.webp";
import bu4 from "./images/bu4.webp";
 

export const prices = {
  "iPhone 15": {
    "128 GB": {
      "Звичайна ціна": " 22282 грн",
      "Ціна зі знижкою": "18939 грн",
      "Сума повернення": "4902 грн",
      "Ціна з TAX-Free": "17386 грн",
    },
    "256 GB": {
      "Звичайна ціна": "25083 грн",
      "Ціна зі знижкою": "21316 грн",
      "Сума повернення": "5526 грн",
      "Ціна з TAX-Free": "19554 грн",
    },
    "512 GB": {
      "Звичайна ціна": "27003 грн",
      "Ціна зі знижкою": "22977 грн",
      "Сума повернення": "5943 грн",
      "Ціна з TAX-Free": "21084 грн",
    },
    "1TB": {},
  },
  "iPhone 15 Plus": {
    "128 GB": {
      "Звичайна ціна": "26197 грн",
      "Ціна зі знижкою": "22274 грн",
      "Сума повернення": "5766 грн",
      "Ціна з TAX-Free": "20432 грн",
    },
    "256 GB": {
      "Звичайна ціна": "28544 грн",
      "Ціна зі знижкою": "24263 грн",
      "Сума повернення": "6289 грн",
      "Ціна з TAX-Free": "722278 грн",
    },
    "512 GB": {
      "Звичайна ціна": "31991 грн",
      "Ціна зі знижкою": "27227 грн",
      "Сума повернення": "7045 грн",
      "Ціна з TAX-Free": "24978 грн",
    },
    "1TB": {},
  },
  "iPhone 15 Pro": {
    "128 GB": {
      "Звичайна ціна": "31195 грн",
      "Ціна зі знижкою": "26541 грн",
      "Сума повернення": "6869 грн",
      "Ціна з TAX-Free": "24338 грн",
    },
    "256 GB": {
      "Звичайна ціна": "35353 грн",
      "Ціна зі знижкою": "30067 грн",
      "Сума повернення": "7786 грн",
      "Ціна з TAX-Free": "27563 грн",
    },
    "512 GB": {
      "Звичайна ціна": "42531 грн",
      "Ціна зі знижкою": "36184 грн",
      "Сума повернення": "9389 грн",
      "Ціна з TAX-Free": "33280 грн",
    },
    "1TB": {
      "Звичайна ціна": "45831 грн",
      "Ціна зі знижкою": "39071 грн",
      "Сума повернення": "10121 грн",
      "Ціна з TAX-Free": "35837 грн",
    },
  },
  "iPhone 15 Pro Max": {
    "128 GB": {},
    "256 GB": {
      "Звичайна ціна": "37621 грн",
      "Ціна зі знижкою": "31925 грн",
      "Сума повернення": "8269 грн",
      "Ціна з TAX-Free": "29296 грн",
    },
    "512 GB": {
      "Звичайна ціна": "47331 грн",
      "Ціна зі знижкою": "40277 грн",
      "Сума повернення": "10417 грн",
      "Ціна з TAX-Free": "36984 грн",
    },
    "1TB": {
      "Звичайна ціна": "50131 грн",
      "Ціна зі знижкою": "42521 грн",
      "Сума повернення": "11055 грн",
      "Ціна з TAX-Free": "9066 грн",
    },
  },
};

export const infoIphons = {
  "iPhone 15": {
    display: `6,1'' , Super Retina XDR OLED, 2556х1179, скло Ceramic Shield.`,
    chipset: "A16 Bionic",
    ram: "6 ГБ",
    time: "Відтворен­ня відео: до 20 годин, Перегляд відео в режимі стрімінгу: до 16 годин, Відтворен­ня аудіо: до 80 годин",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other:
      "захист від пилу і води IP68, Apple Pay, фронтальний сканер Face ID.",
    colors: "чорний, синій, зелений, жовтий і рожевий.",
    image: [i11, i12, i13],
    description: (
      <>
        <p>
          <strong>iPhone 15</strong> має міцний титановий корпус та потужний
          процесор Bionic A17. При цьому екран iPhone 15 має діагональ 6,2", а
          ємність акумулятора становить 3877 мАч.
        </p>
        <p>
          <strong>Також девайс оснащений роз'ємом USB Type-C</strong> для
          зарядки або підключення гаджетів та овальним Dynamic Island.
        </p>
      </>
    ),
  },

  "iPhone 15 Plus": {
    display: `6,7" , Super Retina XDR OLED, 2796х1290, скло Ceramic Shield.`,
    chipset: "A16 Bionic",
    ram: "6 ГБ",
    time: "Відтворен­ня відео: до 20 годин, Перегляд відео в режимі стрімінгу: до 16 годин, Відтворен­ня аудіо: до 80 годин",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other:
      "захист від пилу і води IP68, Apple Pay, фронтальний сканер Face ID.",
    colors: "чорний, синій, зелений, жовтий і рожевий.",
    image: [i21, i22, i23],

    description: (
      <>
        <p>
          <strong> iPhone 15 Plus</strong> має міцний титановий корпус та
          потужний процесор Bionic A17. При цьому екран iPhone 15 Plus має
          діагональ 6,7", а ємність акумулятора становить 4912 мАч.
        </p>
        <p>
          <strong>Також девайс оснащений роз'ємом USB Type-C</strong> для
          зарядки або підключення гаджетів та овальним Dynamic Island.
        </p>
      </>
    ),
  },
  "iPhone 15 Pro": {
    id: 3,
    display: `6,1'' , Super Retina XDR OLED, 2556х1179, скло Ceramic Shield.`,
    chipset: "A17 Pro Bionic",
    ram: "6 ГБ",
    time: "Відтворен­ня відео: до 20 годин, Перегляд відео в режимі стрімінгу: до 16 годин, Відтворен­ня аудіо: до 80 годин",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other:
      "захист від пилу і води IP68, Apple Pay, фронтальний сканер Face ID.",
    colors:
      "титановий чорний, титановий синій, титановий білий, титановий бежевий",
    image: [i31, i32, i33],
    description: (
      <>
        <p>
          <strong>iPhone 15 Pro </strong>має міцний титановий корпус та працює
          на потужному процесорі Bionic A17. Діагональ екрану у девайса
          становить 6,2", а ємність акумулятора - 3650 мАч.
        </p>
        <p>
          <strong>Також, на відміну від 15/15 Plus </strong> версія Pro має
          камеру з телевіком на 12 Мп, 3-кратним наближенням без втрати якості
          та перископним модулем з 5- або 6-кратним зумом.
        </p>
      </>
    ),
  },
  "iPhone 15 Pro Max": {
    display: `6,7" , Super Retina XDR OLED, 2796х1290, скло Ceramic Shield.`,
    chipset: "A17 Pro Bionic",
    ram: "8 ГБ",
    time: "Відтворен­ня відео: до 20 годин, Перегляд відео в режимі стрімінгу: до 16 годин, Відтворен­ня аудіо: до 80 годин",
    camera: "48+12+12 Мп",
    connections: "5G, Wi-Fi 6, Bluetooth 5.3, GPS, USB Type-C.",
    other:
      "захист від пилу і води IP68, Apple Pay, фронтальний сканер Face ID.",
    colors:
      "титановий чорний, титановий синій, титановий білий, титановий бежевий",
    image: [i41, i42, i43],
    description: (
      <>
        <p>
          <strong>iPhone 15 Pro Max </strong>має міцний титановий корпус та
          працює на потужному процесорі Bionic A17. Діагональ екрану у девайса
          становить 6,7", а ємність акумулятора - 4852 мАч.
        </p>
        <p>
          <strong>Також, на відміну від 15/15 Plus</strong> версія Pro Max має
          камеру з телевіком на 12 Мп, 3-кратним наближенням без втрати якості
          та перископним модулем з 5- або 6-кратним зумом.
        </p>
      </>
    ),
  },
};
export const reviews = [
  {
    image: r1,
    avatar: rv1,
    text: "Придбав у даному магазині iPhone 15 pro та Pro Max на 512 gb. Можу з 100% впевненістю сказати, що запропонували найкращу ціну, оскільки перед покупкою промоніторив всі пункти продажу. Дівчина-консультант доступно та терпляче все розповіла. Ну це просто круто.",
    name: "Віктор Єрофєєв",
  },
  {
    image: r2,
    avatar: rv2,
    text: "Велике спасибі магазину! Придбала IPhone 13, багато відгуків читала, боялася придбавати, але зараз не жалкую. Телефон дуже хороший, покупкою задоволена. Сервіс магазину відмінний, продавець хороший, відзивчивий, доставка точно за часом, що дуже зручно)",
    name: "Галина Аневич",
  },
  {
    image: r3,
    avatar: rv3,
    text: "Цей магазин рекомендували друзі: «перевірений! не пошкодуєш» І я не пошкодувала. Придбала 14 Pro, при чому за дуже смачною ціною. Доставили за передоплатою за 2 дні. Всім задоволена. Дякую",
    name: "Алія Севостьянова",
  },
  {
    image: r4,
    avatar: rv4,
    text: `Дякую, ще раз💋 Це не перша моя покупка в цьому магазині, тепер до свого iPhone придбала годинник. Як завжди все на висоті, дякую !!💃`,
    name: "Діна Суворова",
  },
  {
    image: r5,
    avatar: rv5,
    text: "Це вже не перша моя покупка в даному магазині! Цього разу замовила у хлопців iPhone 14 Pro Max 256gb! Якість 100% Дуже задоволена своїм новим телефоном! Дякую ще раз! Ціна порадувала)))",
    name: "Тетяна Семенова",
  },
  {
    image: r6,
    avatar: rv6,
    text: "Дуже швидка доставка, дякую велике за телефон, всім задоволена😊за подарунки окремо дякую🥰",
    name: "Резида Закирова",
  },
  {
    image: r7,
    avatar: rv7,
    text: `Покупкою дуже задоволена! Швидка доставка👍 Відмінне обслуговування 👍`,
    name: "Камілла Анісімова",
  },
  {
    image: r8,
    avatar: rv8,
    text: "Це вже не перша моя покупка в даному магазині! Цього разу замовила у хлопців iPhone 14 Pro Max 256gb! Якість 100% Дуже задоволена своїм новим телефоном! Дякую ще раз! Ціна порадувала)))",
    name: "Ольга Каберник",
  },
  {
    image: r9,
    avatar: rv9,
    text: "Нарешті отримали доставку нашого макбука😎 Дякую велике вам і всьому колективу магазину)) Чоловік задоволений як слон😋",
    name: "Євгенія Крупеніна",
  },
  {
    image: r10,
    avatar: rv10,
    text: `Тільки що доставили! Дякую велике, Українська мову підтримує!😍 Телефон хоч і Б.У, але в ідеальному стані! Все відповідає звіту!😍 Дуже чекаю повернення TAX-Free, обіцяли до 3 червня 👍`,
    name: "Валерія Синіцина",
  },
  {
    image: r11,
    avatar: rv11,
    text: "Тільки що отримала доставку! Як і обіцяли кур'єр дав час перевірити телефон на включення та порівняти всі номери на офіційному сайті! Дякую вам велике! Буду рекомендувати друзям",
    name: "Вероніка Староватова",
  },
  {
    image: r12,
    avatar: rv12,
    text: "Дякую велике! Доставили за 5 днів, чекаю повернення по такс фрі 😊",
    name: "Ростислав Сахаров",
  },
  {
    image: r13,
    avatar: rv13,
    text: `Придбала оригінальні навушники AirPods Pro Доставка зайняла 6 днів Дякую велике, буду рекомендувати друзям`,
    name: "Регіна Козлова",
  },
  {
    image: r14,
    avatar: rv14,
    text: `ДЯКУЮ ВЕЛИКЕ ВАМ 😍😍😍 ПРИДБАЛИ ДВА КРАСЕНЯ 14 PRO MAX ФІОЛЕТОВІ!!!!🥰 Чоловік просто без ума від телефона!!! Ми в захваті!!! Ви найкращий магазин!😘`,
    name: "Ярослава Маркова",
  },
];

export const dataQuestionsAnswers = [
  {
    id: 1,
    question: "Що таке кешбек по Tax free і як його отримати?",
    answer:
      "Tax free – це система повернення суми податку (ПДВ) при замовленні товару з Дубаю, що дозволяє економити при покупці техніки до 22%.",
  },
  {
    id: 2,
    question: "Які умови отримання знижки 15% і повернення 22% по Tax free?",
    answer: `Замовлення пристрою за системою Tax free можливе тільки за умови повної передоплати і в двох варіантах:
  1) Знижка 15%, яку ви отримаєте одразу;
  2) Повернення 22% від суми, які ви отримаєте
  протягом 7 днів з моменту оплати.`,
  },
  {
    id: 3,
    question: `Які умови розстрочки та кредиту?`,
    answer: `Ви зможете придбати смартфон в розстрочку 0% терміном до 12 місяців або в кредит до 2-х років зі ставкою 9,5% річних. При цьому оформлення кредиту чи розстрочка можливе онлайн. Деталі уточнюйте у нашого менеджера.`,
  },
  {
    id: 4,
    question: `Що входить в комплект пристрою?`,
    answer: `При замовленні ви отримаєте повний заводський комплект, який включає в себе: коробку, смартфон, шнур, скрепку, а також адаптер для розетки в подарунок від нашого магазину!`,
  },
  {
    id: 5,
    question: `Чи можна замовити у вас товар без передоплати?`,
    answer: `Так, ви можете замовити у нас післяплатою чохли та захисні скла, але техніка відправляється з мінімальною передоплатою від 20%. Часто перед покупкою самого пристрою у нас замовляють щось із аксесуарів (без передоплати), щоб переконатися у порядності нашого магазину та наявності товару.`,
  },
  {
    id: 6,
    question: `Ви продаєте тільки нові пристрої Apple?`,
    answer: `Ні, ми займаємося як новою, так і Б/У технікою. Але якщо говорити конкретно про iPhone 15 – у нас поки що немає Б/У пропозицій по даній моделі, оскільки вона зовсім недавно надійшла у продаж. Зараз ми продаємо тільки нові iPhone 15.`,
  },
  {
    id: 7,
    question: `Як отримати інформацію про стан пристрою при замовленні Б/У техніки?`,
    answer: `Для будь-якого Б/У пристрою ви можете запросити в нас діагностичний лист, в якому міститься важлива інформація про стан, гарантію та комплект пристрою. Політика нашого магазину – надавати до продажу тільки той Б/У товар, який знаходиться в ідеальному стані.`,
  },
  {
    id: 8,
    question: `Чи можливий повернення товару, якщо мені щось не сподобалося?`,
    answer: `Так, звичайно – у нас діє система повернення товару протягом 14 календарних днів, протягом яких ви можете повернути пристрій. При цьому повернення коштів відбувається по реквізитам банківської картки клієнта протягом до 3 робочих днів з моменту звернення.`,
  },
  {
    id: 9,
    question: `Ваша компанія працює та зареєстрована офіційно?`,
    answer: `Так, звичайно – на нашому сайті представлені скани оригінальних документів (ТТН «Торг-12», договір к-п та поставки товарів, публічна оферта, виписка з ЄГРЮЛ) та інші документи.`,
  },
  {
    id: 10,
    question: `Як я можу бути впевнений, що вам можна довіряти?`,
    answer: `У нас є 2 магазини в Києві, а чохли та захисні скла ми відправляємо післяплатою, без передоплати. Ви можете замовити будь-який недорогий аксесуар, щоб перевірити наш магазин, або ж завітати до нас особисто.`,
  },
  {
    id: 12,
    question: `Які умови офіційної гарантії на смартфони Apple?`,
    answer: `Протягом строку гарантії (1 рік), будь-який клієнт може звернутися в авторизований сервісний центр від Apple та отримати безкоштовний ремонт, незалежно від місця покупки пристрою. Карту доступних АСЦ ви можете переглянути тут. Якщо ж ви замовите Б/У пристрій і по ньому вийде строк офіційної гарантії – ми надамо вам 6 місяців гарантії з ремонтом у нашому сервісі в Києві.`,
  },
  {
    id: 11,
    question: `Які документи потрібно мати при собі, щоб скористатися гарантією?`,
    answer: `Обов'язково зберігайте касовий, товарний чеки та упаковку протягом усього гарантійного строку.`,
  },
];

export const usedIPhones = [
  { name: "Б.У iPhone 14 Pro Max", price: "21 897 ₴", img: bu1 },
  { name: "Б.У iPhone 14 Pro", price: "18 819 ₴", img: bu2 },
  { name: "Б.У iPhone 13 Pro Max", price: "15 368 ₴", img: bu3 },
  { name: "Б.У iPhone 13 Pro", price: "13 982 ₴", img: bu4 },
];
